source/tolerant-xml/src/test/resources/xml/model/frame.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsse:UsernameToken xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext">
            <wsse:Username>Alice</wsse:Username>
        </wsse:UsernameToken>
    </soap:Header>
    <!-- pre body -->
    <soap:Body>

        <ns:ComplexInheritance xmlns:ns="http://k5.eu/tr/model/inheritance"
                               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <!-- before type -->
            <ns:type ns:baseAttribute="baseAttrValue" ns:subAttribute="subAttrValue" xsi:type="ns:SubType">
                <!-- before base value -->
                <ns:baseElement>baseValue</ns:baseElement>
                <!-- before subvalue -->
                <ns:subElement>subValue</ns:subElement>
                <!-- after subvalue -->
            </ns:type>
        </ns:ComplexInheritance>

    </soap:Body>
    <!-- post body -->
</soap:Envelope>